In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'name':['Adam', 'Bob', 'Dave', 'Fred'],
                  'age': [15, 16, 16, 15],
                  'test1': [95, 81, 89, None],
                  'test2': [80, 82, 84, 88],
                  'teacher': ['Ashby', 'Ashby', 'Jones', 'Jones']})

In [4]:
df

   age  name teacher  test1  test2
0   15  Adam   Ashby     95     80
1   16   Bob   Ashby     81     82
2   16  Dave   Jones     89     84
3   15  Fred   Jones    NaN     88

## More Grouping

In [11]:
g = df.groupby('teacher')
g

In [12]:
df.groupby('teacher').apply(max)

         age  name teacher  test1  test2
teacher
Ashby     16   Bob   Ashby     95     82
Jones     16  Fred   Jones     89     88

In [13]:
df.groupby('teacher').max()

         age  name  test1  test2
teacher
Ashby     16   Bob     95     82
Jones     16  Fred     89     88

In [14]:
df.groupby('age').apply(len)

age
15    2
16    2
dtype: int64

In [15]:
def best_teacher(g):
    return pd.DataFrame({'test1': [g.loc[g.test1.idxmax()].teacher],
                        'test2': [g.loc[g.test2.idxmax()].teacher]})

df.groupby('age').apply(best_teacher)

       test1  test2
age
15  0  Ashby  Jones
16  0  Jones  Jones